# SQL DATA CLEANING PROJECT WITH POSTGRESQL - NETFLIX DATA

## Data Exploration and Transformation

### View first 5 rows

Displaying first 5 rows. Headers are imported as data in the first row.

In [22]:
%%sql

SELECT
    *
FROM netflix
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/mydb
5 rows affected.

,show_id,type,title,director,country,date_added,release_year,rating,duration,listed_in
0,show_id,type,title,director,country,date_added,release_year,rating,duration,listed_in
1,s1,Movie,Dick Johnson Is Dead,Kirsten Johnson,United States,9/25/2021,2020,PG-13,90 min,Documentaries
2,s3,TV Show,Ganglands,Julien Leclercq,France,9/24/2021,2021,TV-MA,1 Season,"Crime TV Shows, International TV Shows, TV Act..."
3,s6,TV Show,Midnight Mass,Mike Flanagan,United States,9/24/2021,2021,TV-MA,1 Season,"TV Dramas, TV Horror, TV Mysteries"
4,s14,Movie,Confessions of an Invisible Girl,Bruno Garotti,Brazil,9/22/2021,2021,TV-PG,91 min,"Children & Family Movies, Comedies"

### Creating a Staging Table

While inserting data from the main table, excluding first row that contains headers

In [27]:
%%sql

CREATE TABLE IF NOT EXISTS netflix_raw (
    show_id VARCHAR,
    type VARCHAR,
    title VARCHAR,
    director VARCHAR,
    country VARCHAR,
    date_added VARCHAR,
    release_year VARCHAR,
    rating VARCHAR,
    duration VARCHAR,
    listed_in VARCHAR
);

INSERT INTO netflix_raw (SELECT * FROM netflix WHERE show_id <> 'show_id');

 * postgresql://postgres:***@localhost:5432/mydb
Done.
8790 rows affected.

Empty DataFrame
Columns: []
Index: []

Display first 5 rows

In [28]:
%%sql

SELECT * FROM netflix_raw LIMIT 5;

 * postgresql://postgres:***@localhost:5432/mydb
5 rows affected.

,show_id,type,title,director,country,date_added,release_year,rating,duration,listed_in
0,s1,Movie,Dick Johnson Is Dead,Kirsten Johnson,United States,9/25/2021,2020,PG-13,90 min,Documentaries
1,s3,TV Show,Ganglands,Julien Leclercq,France,9/24/2021,2021,TV-MA,1 Season,"Crime TV Shows, International TV Shows, TV Act..."
2,s6,TV Show,Midnight Mass,Mike Flanagan,United States,9/24/2021,2021,TV-MA,1 Season,"TV Dramas, TV Horror, TV Mysteries"
3,s14,Movie,Confessions of an Invisible Girl,Bruno Garotti,Brazil,9/22/2021,2021,TV-PG,91 min,"Children & Family Movies, Comedies"
4,s8,Movie,Sankofa,Haile Gerima,United States,9/24/2021,1993,TV-MA,125 min,"Dramas, Independent Movies, International Movies"

Get Row Count

In [29]:
%%sql 

SELECT COUNT(*) FROM netflix_raw;

 * postgresql://postgres:***@localhost:5432/mydb
1 rows affected.

   count
0   8790

Check Duplicates in the raw table

In [30]:
%%sql

SELECT show_id, COUNT(*)
FROM netflix_raw
GROUP BY show_id
HAVING COUNT(*) > 1;

 * postgresql://postgres:***@localhost:5432/mydb
0 rows affected.

Empty DataFrame
Columns: []
Index: []

Check Missing (NA) values in each column

In [32]:
%%sql

SELECT
    SUM(CASE WHEN show_id IS NULL THEN 1 ELSE 0 END) AS show_id_na,
    SUM(CASE WHEN type IS NULL THEN 1 ELSE 0 END) AS type_na,
    SUM(CASE WHEN title IS NULL THEN 1 ELSE 0 END) AS title_na,
    SUM(CASE WHEN director IS NULL THEN 1 ELSE 0 END) AS director_na,
    SUM(CASE WHEN country IS NULL THEN 1 ELSE 0 END) AS country_na,
    SUM(CASE WHEN date_added IS NULL THEN 1 ELSE 0 END) AS date_added_na,
    SUM(CASE WHEN release_year IS NULL THEN 1 ELSE 0 END) AS release_year_na,
    SUM(CASE WHEN rating IS NULL THEN 1 ELSE 0 END) AS rating_na,
    SUM(CASE WHEN duration IS NULL THEN 1 ELSE 0 END) AS duration_na,
    SUM(CASE WHEN listed_in IS NULL THEN 1 ELSE 0 END) AS listed_in_na
FROM netflix_raw;

 * postgresql://postgres:***@localhost:5432/mydb
1 rows affected.

,show_id_na,type_na,title_na,director_na,country_na,date_added_na,release_year_na,rating_na,duration_na,listed_in_na
0,0,0,0,0,0,0,0,0,0,0

### Data Types

All data types are character varying

In [34]:
%%sql

SELECT 
    column_name, 
    data_type, 
    table_name 
FROM information_schema.columns
WHERE table_name = 'netflix_raw';

 * postgresql://postgres:***@localhost:5432/mydb
10 rows affected.

    column_name          data_type   table_name
0       show_id  character varying  netflix_raw
1          type  character varying  netflix_raw
2         title  character varying  netflix_raw
3      director  character varying  netflix_raw
4       country  character varying  netflix_raw
5    date_added  character varying  netflix_raw
6  release_year  character varying  netflix_raw
7        rating  character varying  netflix_raw
8      duration  character varying  netflix_raw
9     listed_in  character varying  netflix_raw

### Creating a Clean Table for Data Cleaning and Transformation

Creating a new table to import raw table with desired data types and in order to perform data transformation

In [35]:
%%sql

CREATE TABLE IF NOT EXISTS netflix_clean (
    show_id VARCHAR PRIMARY KEY,
    type VARCHAR,
    title VARCHAR,
    director VARCHAR,
    country VARCHAR,
    date_added DATE,
    release_year INTEGER,
    rating VARCHAR,
    duration INTEGER,
    duration_unit VARCHAR,
    listed_in VARCHAR
);

 * postgresql://postgres:***@localhost:5432/mydb
Done.

Empty DataFrame
Columns: []
Index: []

Inserting data from raw table. Transformed column formats and types.

In [36]:
%%sql

INSERT INTO netflix_clean (
	SELECT
		show_id,
		type,
		title,
		NULLIF(director,''),
		NULLIF(country,''),
		TO_DATE(date_added, 'MM/DD/YYYY') AS date_added,
		release_year::INT,
		rating,
		SPLIT_PART(duration,' ', 1)::INT AS duration,
		SPLIT_PART(duration, ' ', 2) AS duration_unit,
		listed_in
	FROM netflix_raw
	);

 * postgresql://postgres:***@localhost:5432/mydb
8790 rows affected.

Empty DataFrame
Columns: []
Index: []

In [39]:
%%sql

SELECT COUNT(*) AS row_count FROM netflix_clean;

 * postgresql://postgres:***@localhost:5432/mydb
1 rows affected.

   row_count
0       8790

Changing format of type column to have consistency

In [40]:
%%sql

UPDATE netflix_clean
SET type = INITCAP(type);

 * postgresql://postgres:***@localhost:5432/mydb
8790 rows affected.

Empty DataFrame
Columns: []
Index: []

Trimming whitespaces from title, director, country and rating columns

In [41]:
%%sql

UPDATE netflix_clean
SET
    title = TRIM(title),
    director = TRIM(director),
    country = TRIM(country),
    rating = TRIM(rating);

 * postgresql://postgres:***@localhost:5432/mydb
8790 rows affected.

Empty DataFrame
Columns: []
Index: []

Listed_in column contains multiple categories. Creating a new table to store them separately

In [42]:
%%sql

CREATE TABLE IF NOT EXISTS netflix_genres (
    show_id VARCHAR,
    genre VARCHAR
);

 * postgresql://postgres:***@localhost:5432/mydb
Done.

Empty DataFrame
Columns: []
Index: []

In [43]:
%%sql

INSERT INTO netflix_genres (show_id, genre)
SELECT
    show_id,
    TRIM(UNNEST(STRING_TO_ARRAY(listed_in, ',')))
FROM netflix_clean;

 * postgresql://postgres:***@localhost:5432/mydb
19294 rows affected.

Empty DataFrame
Columns: []
Index: []

Directors column contains multiple director. Creating a new table to store them separately

In [52]:
%%sql

CREATE TABLE IF NOT EXISTS netflix_directors (
    show_id VARCHAR,
    director VARCHAR
);

INSERT INTO netflix_directors (show_id, director)
SELECT
    show_id,
    TRIM(UNNEST(STRING_TO_ARRAY(director, ',')))
FROM netflix_clean;

 * postgresql://postgres:***@localhost:5432/mydb
Done.
9610 rows affected.

Empty DataFrame
Columns: []
Index: []

Calculating content age (years since they were released)

In [44]:
%%sql

ALTER TABLE netflix_clean
ADD COLUMN content_age INT;

UPDATE netflix_clean
SET content_age = (SELECT MAX(release_year) FROM netflix_clean) - release_year;

 * postgresql://postgres:***@localhost:5432/mydb
Done.
8790 rows affected.

Empty DataFrame
Columns: []
Index: []

Calculating decade of release year

In [45]:
%%sql

ALTER TABLE netflix_clean
ADD COLUMN release_decade VARCHAR;

UPDATE netflix_clean
SET release_decade = (release_year / 10) * 10 || 's';

 * postgresql://postgres:***@localhost:5432/mydb
Done.
8790 rows affected.

Empty DataFrame
Columns: []
Index: []

In [46]:
%%sql

SELECT * FROM netflix_clean LIMIT 5;

 * postgresql://postgres:***@localhost:5432/mydb
5 rows affected.

,show_id,type,title,director,country,date_added,release_year,rating,duration,duration_unit,listed_in,content_age,release_decade
0,s10,Movie,The Starling,Theodore Melfi,United States,2021-09-24,2021,PG-13,104,min,"Comedies, Dramas",5,2020s
1,s32,Tv Show,Chicago Party Aunt,Not Given,Pakistan,2021-09-17,2021,TV-MA,1,Season,TV Comedies,5,2020s
2,s243,Tv Show,Comedy Premium League,Not Given,Pakistan,2021-08-20,2021,TV-MA,1,Season,"International TV Shows, TV Comedies",5,2020s
3,s1095,Tv Show,The Wedding Coach,Not Given,Pakistan,2021-04-07,2021,TV-MA,1,Season,"Reality TV, Romantic TV Shows",5,2020s
4,s4655,Tv Show,First and Last,Not Given,Pakistan,2018-09-07,2018,TV-MA,1,Season,Docuseries,8,2010s

## Data Analysis on the transformed Netflix Data

Netflixâ€™s content library grown year over year

In [49]:
%%sql

WITH yearly_additions AS (
    SELECT
        EXTRACT(YEAR FROM date_added) AS year_added,
        COUNT(*) AS titles_added
    FROM netflix_clean
    GROUP BY year_added
)
SELECT *
FROM yearly_additions
ORDER BY year_added;

 * postgresql://postgres:***@localhost:5432/mydb
14 rows affected.

   year_added  titles_added
0        2008             2
1        2009             2
2        2010             1
3        2011            13
4        2012             3
5        2013            11
6        2014            24
7        2015            82
8        2016           426
9        2017          1185
10       2018          1648
11       2019          2016
12       2020          1879
13       2021          1498

Trend analysis partitioned by category

In [50]:
%%sql

WITH type_counts AS (
    SELECT
        EXTRACT(YEAR FROM date_added) AS year_added,
        type,
        COUNT(*) AS count
    FROM netflix_clean
    GROUP BY year_added, type
)
SELECT
    year_added,
    type,
    count,
    SUM(count) OVER (PARTITION BY type ORDER BY year_added) AS cumulative_count
FROM type_counts
ORDER BY year_added;

 * postgresql://postgres:***@localhost:5432/mydb
24 rows affected.

   year_added     type  count cumulative_count
0        2008    Movie      1                1
1        2008  Tv Show      1                1
2        2009    Movie      2                3
3        2010    Movie      1                4
4        2011    Movie     13               17
5        2012    Movie      3               20
6        2013    Movie      6               26
7        2013  Tv Show      5                6
8        2014  Tv Show      5               11
9        2014    Movie     19               45
10       2015    Movie     56              101
11       2015  Tv Show     26               37
12       2016    Movie    251              352
13       2016  Tv Show    175              212
14       2017    Movie    836             1188
15       2017  Tv Show    349              561
16       2018    Movie   1237             2425
17       2018  Tv Show    411              972
18       2019  Tv Show    592             1564
19       2019    Movie   1424             3849
20       2020    Movie   1284             5133
21       2020  Tv Show    595             2159
22       2021  Tv Show    505             2664
23       2021    Movie    993             6126

The most popular genres each year

In [51]:
%%sql

WITH genre_counts AS (
    SELECT
        EXTRACT(YEAR FROM nc.date_added) AS year_added,
        ng.genre,
        COUNT(*) AS genre_count
    FROM netflix_clean nc
    JOIN netflix_genres ng
        ON nc.show_id = ng.show_id
    GROUP BY year_added, ng.genre
),
ranked_genres AS (
    SELECT
        *,
        RANK() OVER (PARTITION BY year_added ORDER BY genre_count DESC) AS genre_rank
    FROM genre_counts
)
SELECT *
FROM ranked_genres
WHERE genre_rank <= 5
ORDER BY year_added, genre_rank;

 * postgresql://postgres:***@localhost:5432/mydb
73 rows affected.

   year_added                         genre  genre_count  genre_rank
0        2008                     Thrillers            1           1
1        2008                        Dramas            1           1
2        2008  Stand-Up Comedy & Talk Shows            1           1
3        2008            Independent Movies            1           1
4        2009          International Movies            1           1
..        ...                           ...          ...         ...
68       2021                        Dramas          412           1
69       2021          International Movies          408           2
70       2021                      Comedies          299           3
71       2021        International TV Shows          229           4
72       2021            Action & Adventure          196           5

[73 rows x 4 columns]

Most popular Directors with more than 5 content

In [53]:
%%sql
    
SELECT
	nd.director,
	n.country,
	COUNT(DISTINCT nd.show_id) AS num_of_content
FROM netflix_clean AS n
FULL JOIN netflix_directors AS nd
	ON n.show_id = nd.show_id
WHERE n.director <> 'Not Given'
GROUP BY nd.director,n.country
HAVING COUNT(DISTINCT nd.show_id) > 5
ORDER BY num_of_content DESC;

 * postgresql://postgres:***@localhost:5432/mydb
68 rows affected.

               director         country  num_of_content
0         Rajiv Chilaka           India              22
1   Alastair Fothergill  United Kingdom              19
2           Suhas Kadav           India              16
3          Marcus Raboy   United States              16
4             Jay Karas   United States              15
..                  ...             ...             ...
63        Todd Kauffman          Canada               6
64           Vlad Yudin   United States               6
65      Wenn V. Deramas     Philippines               6
66          William Lau   United States               6
67            Wong Jing       Hong Kong               6

[68 rows x 3 columns]

Number of Movies and TV Shows

In [54]:
%%sql
SELECT
    EXTRACT(YEAR FROM date_added) AS year_added,
    COUNT(CASE WHEN type = 'Movie' THEN show_id END) AS movie_count,
    COUNT(CASE WHEN type = 'Tv Show' THEN show_id END) AS tv_show_count
FROM netflix_clean
GROUP BY EXTRACT(YEAR FROM date_added)
ORDER BY year_added;

 * postgresql://postgres:***@localhost:5432/mydb
14 rows affected.

   year_added  movie_count  tv_show_count
0        2008            1              1
1        2009            2              0
2        2010            1              0
3        2011           13              0
4        2012            3              0
5        2013            6              5
6        2014           19              5
7        2015           56             26
8        2016          251            175
9        2017          836            349
10       2018         1237            411
11       2019         1424            592
12       2020         1284            595
13       2021          993            505

In [60]:
%%sql

SELECT
    type,
    COUNT(show_id) AS content_count
FROM netflix_clean
GROUP BY type;

 * postgresql://postgres:***@localhost:5432/mydb
2 rows affected.

      type  content_count
0  Tv Show           2664
1    Movie           6126